## Koşullu Eleman İşlemleri

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(3,30,(10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    12    16     4
1    10    20    14
2    22    21    20
3    20    27    18
4    18    20    22
5    22    28    26
6    15    11    15
7    11    18    10
8    18     7     4
9    17    13    21

In [2]:
df["var1"]

0    12
1    10
2    22
3    20
4    18
5    22
6    15
7    11
8    18
9    17
Name: var1, dtype: int64

In [3]:
df[0:2]

   var1  var2  var3
0    12    16     4
1    10    20    14

In [4]:
df[0:2]["var1"]

0    12
1    10
Name: var1, dtype: int64

In [5]:
df[0:2][["var1","var2"]]

   var1  var2
0    12    16
1    10    20

In [6]:
df

   var1  var2  var3
0    12    16     4
1    10    20    14
2    22    21    20
3    20    27    18
4    18    20    22
5    22    28    26
6    15    11    15
7    11    18    10
8    18     7     4
9    17    13    21

In [7]:
df.var1

0    12
1    10
2    22
3    20
4    18
5    22
6    15
7    11
8    18
9    17
Name: var1, dtype: int64

In [8]:
df.var1 > 15

0    False
1    False
2     True
3     True
4     True
5     True
6    False
7    False
8     True
9     True
Name: var1, dtype: bool

In [8]:
df[df.var1 > 15]

   var1  var2  var3
2    29     3    18
3    17    24    14
4    26     3    16
8    28    22    21

In [10]:
df.loc[df.var1 > 15]   # iloc gives an error -> iloc => i = 0, 1, 2

   var1  var2  var3
2    22    21    20
3    20    27    18
4    18    20    22
5    22    28    26
8    18     7     4
9    17    13    21

In [9]:
df[df.var1 > 15]["var1"]

2    29
3    17
4    26
8    28
Name: var1, dtype: int32

In [15]:
df[(df.var1 > 10) & (df.var3 < 20)]

   var1  var2  var3
2    29     3    18
3    17    24    14
4    26     3    16

In [19]:
# df[df.var1 > 10, "var1"]  hata verir

In [21]:
# df[df.var1 > 10, ["var1","var2"]]  hata verir

In [22]:
df.loc[df.var1 > 10, ["var1","var2"]]

   var1  var2
2    29     3
3    17    24
4    26     3
6    12    24
8    28    22

In [23]:
df[df.var1 > 10][["var1","var2"]]

   var1  var2
2    29     3
3    17    24
4    26     3
6    12    24
8    28    22